app/Controllers/AdminController.php

    public function index()
    {
        // Récupérer les absents du jour
        $db = \Config\Database::connect();
        $absents = $db->query("
            SELECT DISTINCT conges.id, employes.nom, types_conge.nom as type_nom
            FROM conges
            JOIN employes ON employes.id = conges.employe_id
            JOIN types_conge ON types_conge.id = conges.type_conge_id
            WHERE conges.statut = 'approuvee'
            AND conges.date_debut <= DATE('now')
            AND conges.date_fin >= DATE('now')
        ")->getResultArray();

        $data = [
            'title' => 'Vue d\'ensemble',
            'breadcrumb' => 'Administration',
            'total_employes' => $this->employeModel->countAll(),
            'demandes_en_attente' => $this->congeModel->where('statut', 'en_attente')->countAllResults(),
            'demandes_approuvees' => $this->congeModel->where('statut', 'approuvee')->countAllResults(),
---
SELECT COUNT(*) AS `numrows` FROM `employes`
SELECT COUNT(*) AS `numrows`
FROM `conges`
WHERE `statut` = 'en_attente'
SELECT COUNT(*) AS `numrows`
FROM `conges`
WHERE `statut` = 'approuvee'

    public function employes()
    {
        $employes = $this->employeModel
            ->select('employes.*, departements.nom as dept_nom')
            ->join('departements', 'departements.id = employes.departement_id')
            ->findAll();

        $departements = $this->departementModel->findAll();
---
SELECT `employes`.*, `departements`.`nom` as `dept_nom`
FROM `employes`
JOIN `departements` ON `departements`.`id` = `employes`.`departement_id`
SELECT *
FROM `departements`

    public function demandes()
    {
        $conges = $this->congeModel
            ->select('conges.*, employes.nom as employe_nom, types_conge.nom as type_nom')
            ->join('employes', 'employes.id = conges.employe_id')
            ->join('types_conge', 'types_conge.id = conges.type_conge_id')
            ->findAll();
---
SELECT `conges`.*, `employes`.`nom` as `employe_nom`, `types_conge`.`nom` as `type_nom`
FROM `conges`
JOIN `employes` ON `employes`.`id` = `conges`.`employe_id`
JOIN `types_conge` ON `types_conge`.`id` = `conges`.`type_conge_id`

    public function storeEmploye()
    {
        $nom = $this->request->getPost('nom');
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');
        $departement_id = $this->request->getPost('departement_id');
        $role = $this->request->getPost('role');

        // Validation basique
        if (empty($nom) || empty($email) || empty($password) || empty($departement_id) || empty($role)) {
            return redirect()->back()->with('error', 'Tous les champs sont requis')->withInput();
        }

        // Vérifier que l'email n'existe pas déjà
        $existing = $this->employeModel->where('email', $email)->first();
        if ($existing) {
            return redirect()->back()->with('error', 'Cet email existe déjà')->withInput();
        }

        // Créer l'employé (le model hashera le password automatiquement)
        $employe_id = $this->employeModel->insert([
            'nom' => $nom,
            'email' => $email,
            'password' => $password,  // Le model le hashera via beforeInsert
            'departement_id' => $departement_id,
            'role' => $role,
            'created_at' => date('Y-m-d H:i:s'),
        ]);
---
SELECT *
FROM `employes`
WHERE `email` = 'rakoto@rh.mg'
 LIMIT 1
INSERT INTO `employes` (`nom`, `email`, `password`, `departement_id`, `role`, `created_at`) VALUES ('Rakoto Kely', 'rakoto@rh.mg', '$2y$10$k3dM19IK9oOZEWLea5ZJWOOsB6OtkJBRjXCZpdwN6qYPPHquLDP0S', '4', 'employe', '2026-05-13 10:14:22')

        // Initialiser les soldes pour tous les types de congé
        $types = $this->typeCongeModel->findAll();
        foreach ($types as $type) {
            $this->soldeModel->insert([
                'employe_id' => $employe_id,
                'type_conge_id' => $type['id'],
                'solde' => $type['jours_par_an'],
            ]);
---
INSERT INTO `soldes` (`employe_id`, `type_conge_id`, `solde`) VALUES (5, 1, 30)