app/Controllers/AuthController.php

    public function login()
    {
        $session = session();
        $model = new EmployeModel();

        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');

        $employe = $model->where('email', $email)->first();
---
SELECT *
FROM `employes`
WHERE `email` = 'anjasoa@gmail.com'
 LIMIT 1