app/Controllers/EmployeController.php

    public function index()
    {
        $userId = session()->get('id');

        $data = [
            'title' => 'Tableau de bord',
            'breadcrumb' => 'Accueil',
            'conges' => $this->congeModel
                ->select('conges.*, types_conge.nom as type_nom')
                ->join('types_conge', 'types_conge.id = conges.type_conge_id')
                ->where('employe_id', $userId)
                ->limit(5)
                ->findAll(),
            'soldes' => $this->soldeModel->where('employe_id', $userId)->findAll(),
---
SELECT `conges`.*, `types_conge`.`nom` as `type_nom`
FROM `conges`
JOIN `types_conge` ON `types_conge`.`id` = `conges`.`type_conge_id`
WHERE `employe_id` = 5
 LIMIT 5
SELECT *
FROM `soldes`
WHERE `employe_id` = 5

    public function demandes()
    {
        $userId = session()->get('id');

        $data = [
            'title' => 'Mes demandes de congé',
            'breadcrumb' => 'Accueil / Mes demandes',
            'conges' => $this->congeModel
                ->select('conges.*, types_conge.nom as type_nom')
                ->join('types_conge', 'types_conge.id = conges.type_conge_id')
                ->where('conges.employe_id', $userId)
                ->findAll(),
---
SELECT `conges`.*, `types_conge`.`nom` as `type_nom`
FROM `conges`
JOIN `types_conge` ON `types_conge`.`id` = `conges`.`type_conge_id`
WHERE `conges`.`employe_id` = 3