app/Controllers/RhController.php

    public function index()
    {
        // Récupérer les congés en attente avec les infos employé et type
        $conges = $this->congeModel
            ->select('conges.*, employes.nom as employe_nom, employes.departement_id, departements.nom as dept_nom, types_conge.nom as type_nom')
            ->join('employes', 'employes.id = conges.employe_id')
            ->join('departements', 'departements.id = employes.departement_id')
            ->join('types_conge', 'types_conge.id = conges.type_conge_id')
            ->where('conges.statut', 'en_attente')
            ->findAll();
---
SELECT `conges`.*, `employes`.`nom` as `employe_nom`, `employes`.`departement_id`, `departements`.`nom` as `dept_nom`, `types_conge`.`nom` as `type_nom`
FROM `conges`
JOIN `employes` ON `employes`.`id` = `conges`.`employe_id`
JOIN `departements` ON `departements`.`id` = `employes`.`departement_id`
JOIN `types_conge` ON `types_conge`.`id` = `conges`.`type_conge_id`
WHERE `conges`.`statut` = 'en_attente'

    public function traiter($action, $id)
    {
        $statut = ($action === 'approuver') ? 'approuvee' : 'refusee';
        $this->congeModel->update($id, ['statut' => $statut]);
---
UPDATE `conges` SET `statut` = 'approuvee'
WHERE `conges`.`id` IN ('1')

    public function soldes()
    {
        $soldes = $this->soldeModel
            ->select('soldes.*, employes.nom as employe_nom, employes.departement_id, departements.nom as dept_nom, types_conge.nom as type_nom')
            ->join('employes', 'employes.id = soldes.employe_id')
            ->join('departements', 'departements.id = employes.departement_id')
            ->join('types_conge', 'types_conge.id = soldes.type_conge_id')
            ->findAll();
---
SELECT `soldes`.*, `employes`.`nom` as `employe_nom`, `employes`.`departement_id`, `departements`.`nom` as `dept_nom`, `types_conge`.`nom` as `type_nom`
FROM `soldes`
JOIN `employes` ON `employes`.`id` = `soldes`.`employe_id`
JOIN `departements` ON `departements`.`id` = `employes`.`departement_id`
JOIN `types_conge` ON `types_conge`.`id` = `soldes`.`type_conge_id`